15deg_40ms/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01;
boundaryField
{
    aerofoil
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}
